/****************************************

  *monsterSuperLeague eventLanguageSet - ui.js*

    [language set]
      langKo(한국어)
      langEn(영어)
      langJa(일본어)
      langTh(태국어)
      langHans(중국어 - 간체)
      langHant(중국어 - 번체)

 ****************************************/
function evLang (langType) {
  var langKo = {        // 한국어
    questTitle: [
      '루나협곡(normal) 8<br><span>지역 5회</span>',
      '신기루유적(normal) 12<br><span>지역 5회</span>',
      '해저동굴(normal) 10<br><span>지역 5회</span>',
      '별의성소(normal) 15<br><span>지역 5회</span>',
      '은빛정령의숲(hard) 6<br><span>지역 5회</span>',
      '노래호수(hard) 10<br><span>지역 5회</span>',
      '파고스해안(hard) 8<br><span>지역 5회</span>',
      '초월의 던전<br><span>15회</span> 클리어',
      '어둠의 던전<br><span>15회</span> 클리어',
      '불의 던전<br><span>15회</span> 클리어',
      '물의 던전<br><span>15회</span> 클리어',
      '나무의 던전<br><span>15회</span> 클리어',
      '빛의 던전<br><span>15회</span> 클리어',
      '스페셜 던전<br><span>15회</span> 클리어',
      '골드던전<br><span>5회</span> 클리어',
      '고대골렘 던전<br><span>5회</span> 클리어',
      '보석 6강화<br><span>5회</span> 진행',
      '스타몬리그<br><span>10회</span> 진행',
      '가디언던전<br><span>1회</span> 클리어',
      '스타몬각성<br><span>9회</span> 진행',
      '미션 5회 달성',
      '미션 10회 달성',
      '미션 15회 달성',
      '미션 20회 달성'
    ],
    rewardTitle: [
      '20,000 골드',
      '20,000 골드',
      '20,000 골드',
      '20,000 골드',
      '30,000 골드',
      '30,000 골드',
      '30,000 골드',
      '(하급)<br>별의과일 20개',
      '(중급)<br>어둠의과일 2개',
      '(중급)<br>불의과일 2개',
      '(중급)<br>물의과일 2개',
      '(중급)<br>나무의과일 2개',
      '(중급)<br>빛의과일 2개',
      '(중급)<br>별의과일 3개',
      '(하급)<br>별의과일 5개',
      '(중급)<br>별의과일 1개',
      '20,000 골드',
      '에너지 30개',
      '에너지 50개',
      '(중급)<br>별의과일 3개',
      '50,000 골드',
      '(상급)별의과일 1개',
      '(상급)비밀의 알 1개',
      '(상급)빛/어둠의 알 1개'
    ],
    eventInfo:
      '<ul>'+
      '<li><span class="bu">● </span>일반미션은 총 20개이고 미션이 5/10/15/20개 달성하면, 추가보상을 받을 수 있습니다.</li>'+
      '<li><span class="bu">● </span>계정 당 1회만 참여 가능하며, 보상은 우편함으로 지급됩니다.</li>'+
      '<li class="caution"><span class="bu">● </span>이벤트 참여기간은 2016/09/27 10:00:00 ~ 2016/10/24 08:59:59 (UTC+9) 입니다.</li>'+
      '</ul>',
    btnName:
      '<span class="btn_normal">받기</span>'+
      '<span class="btn_end">완료</span>'
  }, langEn = {     // 영어
    questTitle: [
      'Clear Lunar Valley stage 8 on Normal 5 times',
      'Clear Mirage Ruins stage 12 on Normal 5 times',
      'Clear Seabed Caves Stage 10 on Normal 5 times',
      'Clear Star Sanctuary Stage 15 on Normal 5 times',
      'Clear Phantom Forest Stage 6 on Hard 5 times',
      'Clear Aria Lake stage 10 on Hard 5 times',
      'Clear Pagos Coast Stage 8 on Hard 5 times',
      'Clear Starstone Dungeon 15 times',
      'Clear Dark Dungeon 15 times',
      'Clear Fire Dungeon 15 times',
      'Clear Water Dungeon 15 times',
      'Clear Wood Dungeon 15 times',
      'Clear Light Dungeon 15 times',
      'Clear Special Dungeon 15 times',
      'Clear Gold Dungeon 5 times',
      'Clear Golem Dungeon 5 times',
      'Make a +6 Gem 5 times',
      'Play 10 Astromon League battles',
      'Clear Guardian Dungeon once',
      'Awaken Astromon 9 times',
      'Complete<br> 5 Missions',
      'Complete<br> 10 Missions',
      'Complete<br> 15 Missions',
      'Complete<br> 20 Missions'
    ],
    rewardTitle: [
      '20,000 Gold',
      '20,000 Gold',
      '20,000 Gold',
      '20,000 Gold',
      '30,000 Gold',
      '30,000 Gold',
      '30,000 Gold',
      '(Low)Star Fruit x20',
      '(Mid)Dark Fruit x2',
      '(Mid)Fire Fruit x2',
      '(Mid)Water Fruit x2',
      '(Mid)Wood Fruit x2',
      '(Mid)Light Fruit x2',
      '(Mid)Star Fruit x3',
      '(Low)Star Fruit x5',
      '(Mid)Star Fruit x1',
      '20,000 Gold',
      'Energy x30',
      'Energy x50',
      '(Mid)Star Fruit x3',
      '50,000 Gold',
      '(High) Star Fruit x1',
      '(High) Secret Egg x1',
      '(High) Light/Dark Egg x1'
    ],
    eventInfo:
    '<ul>'+
    '<li><span class="bu">● </span>There are 20 missions in total. You can get bonus rewards after completing 5/10/15/20 events.</li>'+
    '<li><span class="bu">● </span>You can only participate once per account. The rewards will be sent to your inbox.</li>'+
    '<li class="caution"><span class="bu">● </span>Event period: 2016/09/27 01:00:00 ~ 2016/10/23 23:59:59 (UTC+0)</li>'+
    '</ul>',
    btnName:
    '<span class="btn_normal">Get Reward</span>'+
    '<span class="btn_end">Completed</span>'
    },
    langJa = {        // 일본어
      questTitle: [
        'ルナ峡谷(ノーマル) ステージ8を5回クリア',
        '蜃気楼の遺跡(ノーマル) ステージ12を5回クリア',
        '海底洞窟(ノーマル) ステージ10を5回クリア',
        '星の聖域(ノーマル) ステージ15を5回クリア',
        '精霊の森(ハード) ステージ6を5回クリア',
        'アリア湖(ハード) ステージ10を5回クリア',
        'パゴス海岸(ハード) ステージ8を5回クリア',
        'スターストーンダンジョンを15回クリア',
        '闇のダンジョンを 15回クリア',
        '火のダンジョンを 15回クリア',
        '水のダンジョンを 15回クリア',
        '木のダンジョンを 15回クリア',
        '光のダンジョンを 15回クリア',
        'スペシャルダンジョンを 15回クリア',
        'ゴールドダンジョンを 5回クリア',
        'ゴーレムダンジョンを 5回クリア',
        'ジュエルを+6まで アップグレード(5回)',
        'スターモンリーグに 10回挑戦',
        'ガーディアンダンジョンを1回クリア',
        'スターモンを 覚醒させる(9回)',
        '5個達成',
        '10個達成',
        '15個達成',
        '20個達成'
      ],
      rewardTitle: [
        '20,000 ゴールド',
        '20,000 ゴールド',
        '20,000 ゴールド',
        '20,000 ゴールド',
        '30,000 ゴールド',
        '30,000 ゴールド',
        '30,000 ゴールド',
        '(下級)スターフルーツ x20',
        '(中級)ダークフルーツx2',
        '(中級)ファイアフルーツx2',
        '(中級)ウォーターフルーツx2',
        '(中級)ウッドフルーツx2',
        '(中級)ライトフルーツx2',
        '(中級)スターフルーツ x3',
        '(下級)スターフルーツ x5',
        '(中級)スターフルーツ x1',
        '20,000 ゴールド',
        'エネルギー x30',
        'エネルギー x50',
        '(中級)スターフルーツ x3',
        '50,000 ゴールド',
        '(上級)スターフルーツ x1',
        '(上級)秘密の卵 x1',
        '(上級)光/闇の卵 x1'
      ],
      eventInfo:
        '<ul>'+
        '<li><span class="bu">● </span>ミッションは20個あり、ミッションを5/10/15/20個達成するとボーナスアイテムがもらえます.</li>'+
        '<li><span class="bu">● </span>アカウント1つにつき1度だけ参加でき、アイテムは受信箱に届きます.</li>'+
        '<li class="caution"><span class="bu">● </span>イベント実施期間: 2016/09/27 10:00:00 ~ 2016/10/24 08:59:59 (UTC+9)</li>'+
        '</ul>',
      btnName:
        '<span class="btn_normal">受け取る</span>'+
        '<span class="btn_end">受取済み</span>'
    }, langTh = {       // 태국어
      questTitle: [
        'เคลียร์ด่าน 8 หุบเขาพิลึก (ปกติ) 5 ครั้ง',
        'เคลียร์ด่าน 12ซากปรักหักพังลวงตา(ปกติ) 5 ครั้ง',
        'เคลียร์ด่าน 10 ถ้้ำใต้ทะเล (ปกติ) 5 ครั้ง',
        'เคลียร์ด่าน 15 วิหารแห่งดวงดาว (ปกติ) 5 ครั้ง',
        'เคลียร์ด่าน 6 ป่าแห่งวิญญาณ (ยาก) 5 ครั้ง',
        'เคลียร์ด่าน 10 ทะเลสาบเสนาะโสต (ยาก) 5 ครั้ง',
        'เคลียร์ด่าน 8 ชายฝั่งปากอส (ยาก) 5 ครั้ง',
        'เคลียร์ดันเจี้ยนศิลาดวงดาว 15 ครั้ง',
        'เคลียร์ดันเจี้ยนความมืด15 ครั้ง',
        'เคลียร์ดันเจี้ยนไฟ15 ครั้ง',
        'เคลียร์ดันเจี้ยนน้ำ 15 ครั้ง',
        'เคลียร์ดันเจี้ยนไม้ 15 ครั้ง',
        'เคลียร์ดันเจี้ยนแสงสว่าง 15 ครั้ง',
        'เคลียร์ดันเจี้ยนพิเศษ 15 ครั้ง',
        'เคลียร์ดันเจี้ยนทองคำ 5 ครั้ง',
        'เคลียร์ดันเจี้ยนโกเล็ม 5 ครั้ง',
        'อัพเกรดอัญมณี +6 5 ครั้ง',
        'เข้าร่วมแอสโตรมอนลีก 10 ครั้ง',
        'เคลียร์ดันเจี้ยนผู้พิทักษ์ 1 ครั้ง',
        'เสริมพลังแอสโตรมอน 9 ครั้ง',
        'เคลียร์ภารกิจ 5 ครั้ง',
        'เคลียร์ภารกิจ 10 ครั้ง',
        'เคลียร์ภารกิจ 15 ครั้ง',
        'เคลียร์ภารกิจ 20 ครั้ง'
      ],
      rewardTitle: [
        '20,000 ทอง',
        '20,000 ทอง',
        '20,000 ทอง',
        '20,000 ทอง',
        '30,000 ทอง',
        '30,000 ทอง',
        '30,000 ทอง',
        '[ต่ำ] ผลไม้แห่งดวงดาว 20 ชิ้น',
        '[ปานกลาง]ผลไม้แห่งความมืด 2 ชิ้น',
        '[ปานกลาง]ผลไม้แห่งไฟ 2 ชิ้น',
        '[ปานกลาง]ผลไม้แห่งน้ำ 2 ชิ้น',
        '[ปานกลาง]ผลไม้แห่งไม้ 2 ชิ้น',
        '[ปานกลาง]ผลไม้แห่งแสงสว่าง 2 ชิ้น',
        '[ปานกลาง] ผลไม้แห่งดวงดาว 3 ชิ้น',
        '[ต่ำ] ผลไม้แห่งดวงดาว 5 ชิ้น',
        '[ปานกลาง] ผลไม้แห่งดวงดาว 1 ชิ้น',
        '20,000 ทอง',
        'พลังงาน 30 ชิ้น',
        'พลังงาน 50 ชิ้น',
        '[ปานกลาง] ผลไม้แห่งดวงดาว 3 ชิ้น',
        '50,000 ทอง',
        '[สูง] ผลไม้แห่งดวงดาว 1 ชิ้น',
        '[สูง] ไข่แห่งความลับ 1 ชิ้น',
        '[สูง] ไข่แห่งแสงสว่าง/ความมืด 1 ชิ้น'
      ],
      eventInfo:
        '<ul>'+
        '<li><span class="bu">● </span>ภารกิจปกติมีทั้งหมด 20 ภารกิจ หากทำสำเร็จทุกๆ 5/10/15/20 ภารกิจจะได้รับรางวัลเพิ่ม</li>'+
        '<li><span class="bu">● </span>สามารถเข้าร่วมได้บัญชีละหนึ่งครั้งเท่านั้น รางวัลจะถูกส่งไปยังตู้จดหมาย</li>'+
        '<li class="caution"><span class="bu">● </span>รระยะเวลากิจกรรม: 2016/09/27 08:00:00 ~ 2016/10/24 06:59:59 (UTC+7)</li>'+
        '</ul>',
      btnName:
        '<span class="btn_normal">รับรางวัล</span>'+
        '<span class="btn_end">รับรางวัล</span>'
    }, langHans = {       // 간체
      questTitle: [
        '通过月之山谷(普通) 第8关 5次',
        '通过海市蜃楼遗迹 (普通)第12关 5次',
        '通过海床洞窟(普通) 第10关 5次',
        '通过星之圣殿(普通) 第15关 5次',
        '通过幻影森林(困难) 第6关 5次',
        '通过歌咏之湖(困难) 第10关 5次',
        '通过帕戈海岸(困难) 第8关 5次',
        '通过星石副本 15次',
        '通过暗域副本 第15次',
        '通过火域副本 15次',
        '通过水域副本15次',
        '通过木域副本15次',
        '通过光域副本15次',
        '通过特殊副本15次',
        '通过黄金副本5次',
        '通过魔像副本5次',
        '升级5颗宝石至+6',
        '进行10次星兽联赛',
        '通过守护者副本1次',
        '进行9次星兽觉醒',
        '达成任务5次',
        '达成任务10次',
        '达成任务15次',
        '达成任务20次'
      ],
      rewardTitle: [
        '20,000金币',
        '20,000金币',
        '20,000金币',
        '20,000金币',
        '30,000金币',
        '30,000金币',
        '30,000金币',
        '[低>星之果20个',
        '[中>暗之果2个',
        '[中]火之果2个',
        '[中]水之果2个',
        '[中]木之果2个',
        '[中]光之果2个',
        '[中]星之果3个',
        '[低]星之果5个',
        '[中]星之果1个',
        '20,000金币',
        '能量x30',
        '能量x50',
        '[中]星之果3个',
        '50,000金币',
        '[高]星之果1颗',
        '[高]神秘的蛋1个',
        '[高]光暗之蛋1个'
      ],
      eventInfo:
        '<ul>'+
        '<li><span class="bu">● </span>共有20项普通任务，各别达成5、10、15、20项任务时，将可获得额外奖励.</li>'+
        '<li><span class="bu">● </span>单一帐号仅限参与一次，奖励将发送至收件箱内.</li>'+
        '<li class="caution"><span class="bu">● </span>活动期间: 2016/09/27 09:00:00 ~ 2016/10/24 07:59:59 (UTC+8)</li>'+
        '</ul>',
      btnName:
        '<span class="btn_normal">领取奖励</span>'+
        '<span class="btn_end">已领取</span>'
  }, langHant = {         // 번체
    questTitle: [
      '通過月亮谷(普通) 第8關 5次',
      '通過海市蜃樓遺跡 (普通)第12關 5次',
      '通過海底洞窟(普通) 第10關 5次',
      '通過星辰聖殿(普通) 第15關 5次',
      '通過魅影森林(困難) 第6關 5次',
      '通過詠嘆之湖(困難) 第10關 5次',
      '通過帕格斯海岸(困難) 第8關 5次',
      '通過星石地城 15次',
      '通過暗之地城 15次',
      '通過火之地城 15次',
      '通過水之地城15次',
      '通過木之地城15次',
      '通過光之地城15次',
      '通過特殊地城15次',
      '通過金幣地城5次',
      '通過魔偶地城5次',
      '升級5顆寶石至+6',
      '進行10次 星獸聯盟戰鬥',
      '通過守護者地城1次',
      '進行9次 星獸覺醒',
      '達成任務5次',
      '達成任務10次',
      '達成任務15次',
      '達成任務20次'
    ],
    rewardTitle: [
      '20,000金幣',
      '20,000金幣',
      '20,000金幣',
      '20,000金幣',
      '30,000金幣',
      '30,000金幣',
      '30,000金幣',
      '[低>星果20個',
      '[中]暗星果2個',
      '[中]火星果2個',
      '[中]水星果2個',
      '[中]木星果2個',
      '[中]光星果2個',
      '[中]星果3個',
      '[低]星果5個',
      '[中]星果1個',
      '20,000金幣',
      '能量x30',
      '能量x50',
      '[中]星果3個',
      '50,000金幣',
      '[高]星果1顆',
      '[高]神祕卵1個',
      '[高]光暗卵1個'
    ],
    eventInfo:
      '<ul>'+
      '<li><span class="bu">● </span>共有20項普通任務，各別達成5、10、15、20項任務時，將可獲得額外獎勵.</li>'+
      '<li><span class="bu">● </span>單一帳號僅限參與一次，獎勵將發送至信箱內.</li>'+
      '<li class="caution"><span class="bu">● </span>活動期間: 2016/09/27 09:00:00 ~ 2016/10/24 07:59:59 (UTC+8)</li>'+
      '</ul>',
    btnName:[
    '<span class="btn_normal">領取獎勵</span>'+
    '<span class="btn_end">完成領取</span>'
    ]
  }

  if (langType == 'ko'){
    return langKo
  }else if (langType == 'en'){
    return langEn
  }else if(langType == 'ja'){
    return langJa
  }else if(langType == 'th'){
    return langTh
  }else if (langType == 'zh-CN'){
    return langHans
  }else if (langType == 'zh-TW'){
    return langHant
  }else{
    return '존재하지 않는 언어입니다.'
  }
}